Repository: mozilla-l10n/mt-training-data
Catalog: ig/ig_pontoon.tmx
Source language: en_us
Languages: ig

source: Learn tips and shortcuts to help you work faster
ig: Mụta ndụmọdụ na mkpịrịsị ụzọ iji nyere gị aka na ịrụ ọrụ ọsọ ọsọ

source: Learn to find and install open apps to add more fun and functionality to your device
ig: Mụta otu esi achọta ma wụnye ngwa ndị mepere emepe iji tinyekwuo ọhụụ na arụmọrụ na ngwaọrụ gị

source: Learn to set up accounts, read, send and manage emails
ig: Mụta otu esi atọlite akaụntụ, gụọ, zipu ma jikwaa email

source: Leave a message for {contributor}:
ig: Hapụ ozi maka {contributor}:

source: Leave a message for {rest} and {last}:
ig: Hapụ ozi maka {rest} na {last}:

source: Legal Notices
ig: Ọkwa Iwu

source: Less than
ig: Na erughi

source: Let's make Mozilla Support speak your language!
ig: Ka anyị mee Nkwado Mozilla ka ọsụọ asụsụ gi!

source: Let us know which of the above you would be interested in and we’ll help you get started. It’s great to have you onboard!
ig: Mee ka anyị mara nke n'ime ihe ndị dị n'elu ị nwere mmasị na ya, anyị ga-enyere gị aka ibido. Ọ dị mma idubata gị!

source: Limited Data
ig: Data Nwere Oke

source: Link target:
ig: Mgbado njikọ:

source: link text
ig: ederede njikọ

source: Link text:
ig: Ederede njikọ:

source: Link to this post.
ig: Njikọ gara na mbisa a.

source: Live
ig: Ozugbo

source: {l} Knowledge Base Discussions
ig: {l} Mkparịta Ụka Ọdụ Nghọta

source: Locale
ig: Mpaghara

source: Locale:
ig: Mpaghara:

source: Locale Editors
ig: Ndị Ndezi Mpaghara

source: [{locale}] KB Team
ig: [{locale}] Otu KB

source: Locale Leaders
ig: Ndị Isi Mpaghara

source: [{locale}] Locale Metrics
ig: Metrik Mpaghara [{locale}]

source: [{locale}] Localization Team
ig: [{locale}] Otu Ntụgharị Asụsụ

source: Locale Metrics
ig: Metrik Mpaghara

source: {locale_name} Discussions
ig: {locale_name} Mkparịta Ụka

source: {locale_name} Discussions | Knowledge Base
ig: {locale_name} Mkparịta Ụka | Ọdụ Nghọta

source: [{locale}][{product}] Localization Dashboard
ig: [{locale}][{product}] Ogwe Ntụgharị Asụsụ

source: Locale Reviewers
ig: Ndị Nyocha Mpaghara

source: Locales
ig: Mpaghara

source: Locales | Knowledge Base
ig: Mpaghara | Ọdụ Nghọta

source: {locale} translation:
ig: Ntụgharị asụsụ {locale}:

source: Localization
ig: Ntụgharị asụsụ

source: Localization Dashboard
ig: Ogwe Ntụgharị Asụsụ

source: Localization Metrics
ig: Metrik Ntụgharị Asụsụ

source: Localization Percentage
ig: Pasenteji Ntụgharị Asụsụ

source: Localization status of all canned responses
ig: Ọkwa ntụgharị asụsụ nke nzaghachi niile ezubere iche

source: Localization Team
ig: Otu Ntụgharị Asụsụ

source: Localize the document
ig: Tụgharịa asụsụ dọkụmentị

source: Locked
ig: Akpọchiri

source: Lock this question
ig: Kpọchie ajụjụ a

source: Lock this thread
ig: Kpọchie usoro a

source: Logged in!
ig: Abanyela!

source: Logging in...
ig: Na-abanye...

source: Log in
ig: Banye

source: Login Problems?
ig: Nsogbu Nbanye?

source: Log In / Register
ig: Banye / Debanye

source: Log in, so you can respond to your question when it is answered:
ig: Banye, yabụ ị nwere ike ịzaghachi ajụjụ gị mgbe azara ya:

source: Log in to an existing account
ig: Banye n'akaụntụ dị adị

source: Look at the top of your screen, and click the menu item called <em>Edit</em>.
ig: Lee anya na elu nke ihuenyo gị, wee pịa ihe menu akpọrọ <em>Dezie</em>.

source: Look at the top of your screen, and click the menu item called <em>Help</em>.
ig: Lee anya n'elu nke ihuenyo gị, wee pịa ihe menu akpọrọ <em>Enyemaka</em>.

source: Love Firefox and have a few moments to help?<br /> Help other Firefox users on Twitter. Good things will come to those who tweet!
ig: Ịhụrụ Firefox n'anya, nwee obere oge ịnyere aka?<br /> Nyere ndị ọrụ Firefox ndị ọzọ aka na Twitter. Ezigbo ihe na eche ndị na ede twiit!

source: Love Firefox? Love Twitter?
ig: Ịhụrụ Firefox N'anya? Ịhụrụ Twitter N'anya?

source: Maintenance in progress
ig: Mmezi na aga n'ihu

source: Major content changes that will make older translations inaccurate
ig: Nnukwu mgbanwe ọdịnaya ga-emebi ntụgharị asụsụ ochie

source: Make Firefox for Android work the way you want through customization.
ig: Mee ka Firefox maka Android rụọ ọrụ otu ị chọrọ site na nhazi.

source: Make Firefox for Android yours with these customization options
ig: Mee Firefox maka Android nke gị site na iji nhọrọ nhazi ndị a

source: Make Firefox yours by adding and managing the features that you want.
ig: Mee Firefox nke gị site na itinye na ijikwa atụmatụ ndị ị chọrọ.

source: Make Firefox yours through customization settings and add-ons
ig: Mee Firefox nke gị site na ntọala na mgbakwunye nhazi

source: Make my email public
ig: Mee ka ọhaneze hụ email m

source: Make privacy a key factor in selecting and interacting with partners.
ig: Mee nzuzo ihe kachasị mkpa site na ịhọrọ na ịnwe mmekọrịta n'etiti ndị mmekọ.

source: Malware
ig: Malụwe

source: Manage add-ons
ig: Jikwaa mgbakwunye

source: Manage preferences and add-ons
ig: Jikwaa mmasị na mgbakwunye

source: Manage watch list
ig: Jikwaa ndepụta nlele

source: Many thanks for your contribution in behalf of SUMO and the happy users who get help!
ig: Nnukwu ekele maka nkwado gị na nnọchite nke SUMO yana ndị ọrụ nwere obi anụrị ndị na enweta enyemaka!

source: Many thanks for your contribution on behalf of SUMO and the happy users who are helped by your work!
ig: Daalụ ukwuu maka enyemaka gị na nnọchite nke SUMO yana ndị ọrụ ji obi anụrị ndị ọrụ gị baara uru!

source: Mark as Ready for Localization
ig: Kaa dị ka Njikere maka Ntụgharị Asụsụ

source: Mark as spam
ig: Kaa dị ka adịgboroja

source: Marked as spam
ig: Akapụtara dị ka adịgboroja

source: Marked as spam by %(marked_by)s at %(marked_time)s
ig: Akapụtara dị ka adịgboroja site n'aka %(marked_by)s na %(marked_time)s

source: Marketplace
ig: Ọdụ ahịa

source: Marketplace: Developer Support Request
ig: Ọdụ ahịa: Arịrịọ Nkwado Ndị Nrụpụta

source: Marketplace: Request a Refund
ig: Ọdụ ahịa: Rịọ Nkwụghachi Ụgwọ

source: Mark it as solved
ig: Kaa ya ka nke ekpeziri

source: Mark read
ig: Kaa ka nke agụgoro

source: Mark Selected as Read
ig: Ka Nke Ahọpụtara dị ka Agụgoro

source: Mark unread
ig: Kaa ka nke agụbeghị

source: Matching responses
ig: Nzaghachi ndị makọrọ

source: media
ig: mgbasa ozi

source: Media Gallery
ig: Ọba Mgbasa Ozi

source: Media Gallery Search
ig: Ọchụchọ Ọba Mgbasa Ozi

source: Message:
ig: Ozi:

source: Message from the reviewer:
ig: Ozi si n'aka onye nyocha:

source: Message is empty
ig: Ozi ghe oghe

source: Message is too long
ig: Ozi toro oke ogologo

source: Message Preview:
ig: Nhụchalụ Ozi:

source: Messages
ig: Ozi

source: Messages didn't add up. Try again.
ig: Ozi agbakọtaghị. Nwaa ọzọ.

source: Metrics
ig: Metrik

source: Minor details that don't affect the instructions
ig: Ntakịrị nkọwa na anaghị emetụta ntuziaka

source: Misc
ig: Misk

source: mobile
ig: mkpanaka

source: Mobile device
ig: Ngwaọrụ mkpanaka

source: Mobile OS for smartphones
ig: OS Mkpanaka maka ekwentị amamịghe

source: Model not allowed.
ig: Anabataghị usoro.

source: Moderate Forum Content
ig: Ọdịnaya Ọgbakọ Dị Ọkara

source: Moderate Twitter Accounts
ig: Akaụntụ Twitter Ndị Dị Mma

source: moderator
ig: onye nduzi

source: Moderator
ig: Onye nduzi

source: Modified:
ig: Edeziri:

source: Modified by {name} on {datetime}
ig: {name} deziri ya na {datetime}

source: Modified {datetime} by {name}
ig: Edeziri {datetime} site na {name}

source: Modified Preferences
ig: Mmasị Ndị Edeziri

source: Month beginning %(year)s-%(month)s-%(date)s
ig: Ọnwa bidoro %(year)s-%(month)s-%(date)s

source: Monthly
ig: Kwa ọnwa

source: Monthly Active Contributors
ig: Ndị Nkwado Kwa Ọnwa Dị Ire

source: More system details
ig: Nkọwapụta sistemụ ndị ọzọ

source: More than
ig: Karịrị

source: More than one level 2 review change drops the localization to 0%
ig: Karịa otu mgbanwe nyocha ọkwa 2 na ewetu ntụgharị asụsụ ka ọ bụrụ 0%

source: Most Recent
ig: Kachasị Nso Nso

source: Most Viewed
ig: Akachasị Lelee

source: Most Visited
ig: Akachasị Gaa

source: Mozilla Support
ig: Nkwado Mozilla

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe.
ig: Nkwado Mozilla bụ ogbe nke ndị mwepụta onwe na ndị ụlọ ọrụ nwere nnukwu mmasị na anwa ịkwado ndị ọrụ anyị nọ na gburugburu ụwa.

source: Mozilla Support is a community of enthusiastic volunteers and employees trying to support our users around the globe. Join us for an incredible adventure!
ig: Nkwado Mozilla bụ ogbe nke ndị mwepụta onwe na ndị ụlọ ọrụ nwere nnukwu mmasị na anwa ịkwado ndị ọrụ anyị nọ na gburugburu ụwa. Sonye anyị maka njem mara oke mma!

source: Mozilla support is fully powered by our volunteer community that is helping hundreds of users everyday. This community is formed by passionate Firefox and Thunderbird users who take some of their spare time to help others. We couldn't do it without your passion and enthusiasm. Your contribution, as minor as it might seem, has tremendous value. Solving one issue in the support forums can help up to 1000 users a day!
ig: Ogbe ndị nrọpụta onwe anyị na akwado nkwado Mozilla n'uju nke na enyere ọtụtụ ndị ọrụ aka kwa ụbọchị. Ndị mebere ogbe a bụ ndị ọrụ Firefox na Thunderbird rọpụtara onwe ha, ndị na ewere obere oge ha iji nyere ndị ọzọ aka. Anyị enwenwughi ike ịme ya na ejighi ịhụnanya na mmasị gị. Nkwado gị, ole ọnwere ike ịbu, nwere nnukwu uru. Igbo otu nsogbu n'ọgbakọ nkwado ahụ nwere ike ịnyere ndị ọrụ 1000 aka n'otu ụbọchị!

source: Mozillians
ig: Ndị Mozilla

source: Mozillians Username
ig: Aha Njirimara ndị Mozilla

source: Multiple Products
ig: Ọtụtụ Ngwaahịa

source: Music, Photos and Video
ig: Egwu, Foto na Vidio

source: My contributions
ig: Ntinye aka m

source: My password isn't working.
ig: Okwuntughe m anaghị arụ ọrụ.

source: My profile
ig: Profaịlụ m

source: My Questions
ig: Ajụjụ M

source: Navigation
ig: Ngagharị

source: Need Changes
ig: Chọrọ Mgbanwe

source: needs attention
ig: chọrọ ntinye uche

source: Needs change
ig: Chọrọ mgbanwe

source: Needs change:
ig: Kwesịrị mgbanwe:

source: Needs info
ig: Chọrọ ozi

source: Needs more information
ig: Chọkwuru ozi

source: Needs Update
ig: Chọrọ Mmelite

source: New announcement for {group}
ig: Amamọkwa ọhụrụ maka {group}

source: New answers for question: %s
ig: Azịza ọhụrụ maka ajụjụ: %s

source: New Article
ig: Edemede Ọhụrụ

source: Newer
ig: Ka ọhụrụ

source: New Message
ig: Ozi Ọhụrụ

source: New password
ig: Okwuntughe ọhụrụ

source: New password:
ig: Okwuntughe ọhụrụ:

source: New Password
ig: Okwuntughe Ọhụrụ

source: New Password Again
ig: Okwuntughe Ọhụrụ Ọzọ

source: News &amp; Resources
ig: Akụkọ &amp; Akụrụngwa

source: News Feeds (RSS), Blogs and Social
ig: Ngụpụta Akụkọ (RSS), Blọọgụ na Mmekọrịta

source: New thread: {title}
ig: Usoro ọhụrụ: {title}

source: next
ig: osote

source: No differences found
ig: Ọnweghị ndịiche ahụrụ

source: No, ignore
ig: Mba, leghara anya

source: No, I'm not.
ig: Mba, abụghị m.

source: No media files found.
ig: Ọnweghị faịlụ mgbasa ozi ahụrụ.

source: No messages selected. Please try again.
ig: Ọnweghị ozi ahọpụtara. Biko nwaa ọzọ.

source: None
ig: Ọnweghị

source: non en-US KB
ig: abụghị en-US KB

source: None of these solve my problem
ig: Ọnweghị otu n'ime ihe ndị a kpeziri nsogbu m

source: No one has helped translate this article yet. If you already know how localizing for SUMO works, <a href="%(document_trans_link)s">start translating now</a>. If you want to learn how to translate articles for SUMO, <a href="%(help_link)s">please start here</a>.
ig: Ọnwebeghị onye nyere aka tụgharịa asụsụ edemede a. Ọ bụrụ na ị marala otu ịtụgharị asụsụ maka SUMO si arụ ọrụ, <a href="%(document_trans_link)s">bido ịtụgharị asụsụ ugbu a</a>. Ọ bụrụ na ị chọrọ ịmụta otu esi atụgharị edemede maka SUMO, <a href="%(help_link)s">biko bido ebe a</a>.

source: No other documents link to {title}.
ig: Ọnweghịzị dọkụmentị ọzọ na ejikọ na {title}.

source: No pages matched the search criteria
ig: Ọnweghị ibe makọrọ na njirisi ọchụchọ

source: No related documents.
ig: Enweghị dọkụmentị emetụtara.

source: No replies
ig: Nzaghachi adịghị

source: No sections found
ig: Ọnweghị ngalaba ahụrụ

source: No Surprises
ig: Ntụmadị Adịghị

source: No tags entered.
ig: Ọnweghị mkpado etinyere.

source: Note: Searching for "tag1, tag2" returns questions tagged with both tag1 and tag2
ig: Nrụbama: Ịchọ "mkpado1, mkpado2" na eweghachite ajụjụ ndị akpadoro mkpado1 yana mkpado 2

source: Note: There are no approved translations for this article.
ig: Nrụbama: Enweghị ntụgharị asụsụ akwadoro maka edemede a.

source: Note: This article has no revisions ready for localization.
ig: Nrụbama: Edemede a enweghị ngụgharị dị njikere maka ntụgharị.

source: Not Helpful
ig: Abaghị Uru

source: Notify me of any future changes to this page
ig: Zitere m ozi maka mgbanwe ọ bụla na ibe n'ọdịnihu

source: Not responded in 24 hours
ig: Azaghachibeghị na aka elekere 24

source: Not responded in 72 hours
ig: Azaghachibeghị na aka elekere 72

source: Not sure how often
ig: O dochaghị anya ugboro ole

source: No users selected!
ig: Ọnweghị ndị ọrụ ahọpụtara!

source: No users were found for your search query.
ig: Ọnweghị ndị ọrụ ahụrụ maka njụajụjụ ọchụchọ gị.

source: No votes data
ig: Data nhọpụta adịghị

source: Now you can combine both and help Firefox users on Twitter. It's quick, it's easy, and you don't have to be a tech superstar to do it. We call it our Army of Awesome.
ig: Ugbu a ị nwere ike ikpokọta ha abụọ ma nyere ndị ọrụ Firefox aka na Twitter. Ọ dị ọsọ, ọ dị mfe, ị gaghị abụ ọkaibe na teknụzụ iji mee ya. Anyị na akpọ ya Igwe Ọmarịcha Ihe anyị.

source: {num} answers
ig: Azịza {num}

source: %(number)d day ago
ig: Ụbọchị %(number)d gara aga

source: %(number)d hour ago
ig: Aka elekere %(number)d gara aga

source: %(number)d minute ago
ig: %(number)d nkeji gara aga

source: %(number)d month ago
ig: %(number)d ọnwa gara aga

source: %(number)d second ago
ig: Ntakịrị nkeji %(number)d gara aga

source: %(number)d week ago
ig: Izu %(number)d gara aga

source: %(number)d year ago
ig: Afọ %(number)d gara aga

source: Numbered List
ig: Ndepụta Nwere Ọnụọgụ

source: Numbered list item
ig: Ihe ndepụta nwere ọnụọgụ

source: Number of active Army of Awesome contributors
ig: Ọnụọgụ nke ndị nkwado Igwe Ọmarịcha Ihe dị ire

source: Number of active contributors to the English KB
ig: Ọnụọgụ nke ndị nkwado dị ire na KB Bekee

source: Number of active contributors to the non-English KB
ig: Ọnụọgụ nke ndị nkwado dị ire na KB na abụghị Bekee

source: Number of active forum contributors
ig: Ọnụọgụ nke ndị nkwado ọgbakọ dị ire

source: Number of answers
ig: Ọnụọgụ nke azịza

source: Number of Answers
ig: Ọnụọgụ nke Azịza

source: Number of replies
ig: Ọnụọgụ nke nzaghachi

source: Number of Replies
ig: Ọnụọgụ nke Nzaghachi

source: Number of votes. Must be an integer.
ig: Ọnụọgụ nke ntuli aka. Ga-abụrịrị intija.

source: %(numerator)s of %(denominator)s
ig: %(numerator)s nke %(denominator)s

source: %(numerator)s <small>of %(denominator)s</small>
ig: %(numerator)s <small>nke %(denominator)s</small>

source: {num} solutions
ig: Asịsa {num}

source: %(num)s <small>of %(total)s</small>
ig: %(num)s <small>nke %(total)s</small>

source: {num_views} views
ig: nlele {num_views}

source: Object does not exist.
ig: Ihe adịghị adị.

source: Obsolete:
ig: Ihe ochie:

source: Official blog
ig: Blọọgụ nke ụlọ ọrụ

source: Oh, no! It looks like an unexpected error occurred. We've already notified the site administrators. Please try again now, or in a few minutes.
ig: Ewoo! Ọ dị ka mperi atụghị anya dapụtara. Anyị ezigala ozi na ndị nchịkwa saịtị ahụ. Biko nwaa ọzọ ugbu a, ma ọ bụ na nkeji ole ma ole.

source: Oh, no! Looks like there are no posts!
ig: Oh, mba! Ọ dị ka enweghị mbisa ọ bụla!

source: Older
ig: Ka ochie

source: Old Password
ig: Okwuntughe Ochie

source: %(old)s-redirect-%(number)i
ig: %(old)s-mbugharị-%(number)i

source: %(old)s Redirect %(number)i
ig: %(old)s Mbugharị %(number)i

source: Once you’ve clicked on the link, you can throw away this email.
ig: Ozugbo ị pịrị njikọ ahụ, ị nwere ike itufu email a.

source: Only displayed on search results page
ig: Egosipụtara naanị n'ibe nsonaazụ ọchụchọ

source: Only use and share information about our users for their benefit and as disclosed in our notices.
ig: Naanị jiri ma kekọrịta ozi gbasara ndị ọrụ anyị maka elele ha yana otu esi gosi n'ọkwa anyị.

source: Oops, there was an error.
ig: Ewoo, enwere mperi.

source: Oops, your request was unsuccessful
ig: Ewoo, arịrịọ gị agaghị nke ọma

source: Open Badges
ig: Mepee Akara

source: Open <em>Help &gt; Troubleshooting Information</em>.
ig: Mepee <em>Enyemaka &gt; Ozi Nchọpụta Nsogbu</em>.

source: Operating system
ig: Sistemụ arụmọrụ

source: Original post date
ig: Ụbọchị mbisa izizi

source: Other Mozilla products
ig: Ngwaahịa Mozilla ndị ọzọ

source: Other (please specify)
ig: Ọzọ (biko kọwaa)

source: Other products
ig: Ngwaahịa ndị ọzọ

source: Other questions with Firefox for Windows 8 Touch.
ig: Ajụjụ ndị ọzọ na Firefox maka Windows 8 Touch.

source: Other reason:
ig: Ebumnuche ọzọ:

source: Other ways to get involved
ig: Ụzọ ndị ọzọ iji tinye aka

source: Our contributors have been working hard on articles and it would be great if you could review them. The faster we get them published the faster they start helping users.
ig: Ndị nkwado anyị na arụsị ọrụ ike n'edemede, ọ ga-ama oke mma ọ bụrụ na ị nwere ike inyocha ha. Anyị mee ngwangwa bipute ha, ọ ga-ebido nyerebe ndị ọrụ aka ọsọ ọsọ.

source: Our volunteers are working on translating this article. Until it's ready, maybe the English version can be of some help.
ig: Ndị mwepụta onwe anyị na arụ ọrụ ịtụgharị asụsụ edemede a. Ruo mgbe ọ dị njikere, ụdị Bekee nwere ike ịba obere uru.

source: Overall
ig: Mgbakọta

source: Overview
ig: Nchịkọta

source: owner
ig: onye nwe ihe

source: Page {0} of {1}.
ig: Ibe {0} nke {1}.

source: Page does not exist.
ig: Ibe adịghị adị.

source: Page {n}
ig: Ibe {n}

source: Page Not Found
ig: Ahụghị Ibe

source: Password
ig: Okwuntughe

source: Password:
ig: Okwuntughe:

source: Password change successful!
ig: Mgbanwe okwuntughe gara nke ọma!

source: Password is required.
ig: Achọrọ okwuntughe.

source: Password must be 8 or more characters.
ig: Okwuntughe ga-abụrịrị mkpụrụedemede 8 ma ọ bụ karịa.

source: Password reset
ig: Ntọgharị okwuntughe

source: Password Reset
ig: Ntọgharị Okwuntughe

source: Password reset on {sitename}
ig: Ntọgharị okwuntughe na {sitename}

source: Password reset unsuccessful
ig: Ntọgharị okwuntughe agaghị nke ọma

source: Passwords, forms and search
ig: Okwuntughe, mpempe akwụkwọ na ọchụchọ

source: Passwords, forms, search, and history - control what Firefox suggests
ig: Okwuntughe, mpempe akwụkwọ, ọchụchọ, na ndekọ - jikwaa ihe Firefox na atụnye

source: Password should be at least 8 characters long and contain at least 1 number.
ig: Okwuntughe kwesịrị ịbụ opekata mpe mkpụrụedemede 8 n'ogologo ma nwee opekata mpe 1 nọmba.

source: Password successfully reset.
ig: Atọgharịrị okwuntughe na enweghị nsogbu.

source: Paste the info in the text box below.
ig: Mado ozi ahụ n'ime igbe ederede dị n'okpuru.

source: Payment Issues
ig: Nsogbu Akwụmụgwọ

source: Payments
ig: Akwụmụgwọ

source: Payments/Settlement
ig: Akwụmụgwọ/Mkpebi

source: Pending
ig: Na eche

source: Percent
ig: Pasentị

source: Percent Localized: All
ig: Pasentị Atụgharịrị: Dum

source: Percent Localized: Top 100
ig: Pasentị Atụgharịrị: 100 Kachasị

source: Percent Localized: Top 20
ig: Pasentị Atụgharịrị: 20 Kachasị

source: Percent Yes
ig: Pasentị Ee

source: Pick a product
ig: Họpụta ngwaahịa

source: Pick a topic and try some solutions
ig: Họpụta isiokwu ma nwalee ụfọdụ asịsa

source: Pick a way to get involved
ig: Họpụta ụzọ iji sonye

source: Please ask a new question if you need help.
ig: Biko jụọ ajụjụ ọhụrụ ma ọ bụrụ na ị chọrọ enyemaka.

source: Please check you are logged in, and try again.
ig: Biko lelee na ị banyere, wee nwaa ọzọ.

source: Please choose a category.
ig: Biko họrọ otu.

source: Please complete the form below to submit your question to our Marketplace Support group.
ig: Biko dejupụta akwụkwọ ahụ dị n'okpuru iji nyefee ajụjụ gị n'aka ọrụ Nkwado Ọdụ Ahịa anyị.

source: Please confirm your email address
ig: Biko kwenye na adreesị email gị

source: Please confirm your email address.
ig: Biko kwenye na adreesị email gị.

source: Please Confirm Your Email Address
ig: Biko Kwenye Na Adreesị Email Gị

source: Please confirm your Firefox Help question
ig: Biko kwenye na ajụjụ Enyemaka Firefox gị

source: Please describe your issue in the body.
ig: Biko kọwaa nsogbu gị n'ahụ ya.

source: Please enter a correct username and password. Note that both fields are case-sensitive.
ig: Biko tinye aha njirimara na okwuntughe ziri ezi. Mara na ogige abụọ ahụ na emetụta ụdịrị mkpụrụedemede.

source: Please enter a facebook.com URL.
ig: Biko tinye URL nke facebook.com.

source: Please enter your password twice.
ig: Biko tinye okwuntughe gị ugboro abụọ.

source: Please keep the length of the body content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke ọdịnaya ahụ ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of the comment to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke asịsa ahụ ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ugbu a ọ bụ mkpụrụedemede %(show_value)s.

source: Please keep the length of the content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke ọdịnaya ahụ ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ugbu a ọ bụ mkpụrụedemede %(show_value)s.

source: Please keep the length of the slug to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke slọg ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of the subject to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke isiokwu ahụ ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of the summary to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke nchịkọta ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of the title to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke aha ahụ ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of your content to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke ọdịnaya gị ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of your description to %(limit_value)s characters or less. It is currently %(show_value)s characters.
ig: Biko dowe ogologo nke nkọwapụta gị ka ọ bụrụ mkpụrụedemede %(limit_value)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(show_value)s ugbu a.

source: Please keep the length of your image filename to %(max)s characters or less. It is currently %(length)s characters.
ig: Biko dowe ogologo nke aha faịlụ onyonyo gị ka ọ bụrụ mkpụrụedemede %(max)s ma ọ bụ pekarịa. Ọ bụ mkpụrụedemede %(length)s ugbu a.
